ci4/app/Models/GuestModel.php

    public function getGuest()
    {
        return $this->findAll();
---
SELECT *
FROM `guests`